"арест:отпуск:6.0"

first_line ="инициативы,мехико,месяцев,гауптвахте,транспорт,берлине,москве,церкви,ходе,счета,оборудование,период,акций,аэродроме,стран,части,изоляторе,качестве,сумму,кассу,тюрьме,октября,иркутском,белграде,траулера,браслетом,мосгорсуде,марта,лицензию,германии,суток,следствия,ноября,грэйвсенде,порту,лондоне,имущество,средства,счетов,азербайджане,дезертирство,распродажу,афганистане,суде"

second_line = "уходу,начале,недели,турции,поездки,связи,работе,ранения,кулуарах,берегу,месяцев,берлине,материнству,день,деревне,островах,москве,написания,крыму,тысяч,уик-энд,эстонии,болезни,юге,родину,приобретения,кредит,компании,недель,трое,полку,россии,университете,войны,ранчо,алтае,сохранением,казарме,восстановления,берег,далмации,ужасом,подмосковье,германии,суток,пределами,рейна,лагере,дней,лондоне,количества,фронта,года,границей,чадом,содержания,исходе,ленинград,год,лет,режиссера,матери,пагелями,окончания,сохранения,греции,рождества,поездках,родителями,территории,встречи,времени,оплаты,литве"

first_items = set(first_line.split(","))

second_items = set(second_line.split(","))

common = first_items.intersection(second_items)

#print(len(common))

d = {"a" : 1, "b" : 2}
d2 = {"a" : 3, "c" : 4}










